MODEL_NAME = 'j-hartmann/emotion-english-distilroberta-base'

""" СПИСОК ПУТЕЙ"""

MEDITATION_PATHS = [
    'Материалы/Binaural_Beats_Sleep_Binaural_Beats_Binaural_Beats_Deep_Sleep_-_Calm_Music_For_Sleep_71199741.mp3',
    'Материалы/Joep_Beving_-_Beving_Ala_73081688.mp3',
    'Материалы/Oneheart_-_this_feeling_SLRB_75139045.mp3',
    'Материалы/Tilekid - You not the same_(Mp3-Bullet.ru).mp3'
]
# Список интересных фактов, статей и ссылок на полезные ресурсы
INTERESTING_FACTS = [
    'Интересный факт о медитации заключается в том, что регулярная практика медитации может изменять структуру и функцию мозга. Исследования показывают, что медитация способна увеличивать толщину коры головного мозга, особенно в областях, связанных с вниманием, эмоциями и самосознанием. Кроме того, медитация может улучшать когнитивные функции, такие как внимание, память и эмоциональное самоконтроль. Таким образом, медитация не только помогает справиться со стрессом, но и может улучшить ваше умственное здоровье и качество жизни.',
    'Интересный факт о важности ментального здоровья заключается в том, что оно может оказывать значительное влияние на физическое здоровье человека. Негативные эмоции и стресс могут снижать иммунную систему, что делает человека более уязвимым для инфекций и болезней. Кроме того, хронический стресс связан с такими проблемами, как сердечно-сосудистые заболевания, диабет, ожирение и другими хроническими заболеваниями. Таким образом, улучшение ментального здоровья через практики, такие как медитация, дыхательные упражнения, регулярный сон и здоровое питание, может не только улучшить качество жизни, но и способствовать физическому здоровью и общему благополучию человека.',
    'Интересный факт о стрессе среди студентов заключается в том, что стресс может оказывать влияние на их академические достижения. Исследования показывают, что студенты, испытывающие высокий уровень стресса, могут иметь более низкие оценки и меньше вероятность успешно завершить свое образование, чем студенты с более низким уровнем стресса.',
]

USEFUL_RESOURCES = [
    'https://newneuro.ru/kak-meditacziya-vliyaet-na-cheloveka/',
    'http://vorcrb.by/novosti/763-vazhnost-psikhicheskogo-zdorovya',
    'https://4brain.ru/blog/9-ways-to-learn-more-effectively/',
]

# Список путей к песням для учебы
STUDY_PATH = [
    'Материалы/Hip-Hop_Lofi_Chill_Hip_Hop_Lofi_Lo-Fi_for_Studying_-_Channeling_Cool_74177217.mp3',
    'Материалы/Hip-Hop_Lofi_Chill_Hip_Hop_Lofi_Lo-Fi_for_Studying_-_Lo-Fi_Girl_74177213.mp3',
    'Материалы/Lofi_Sleep_Chill_Study_Lo-Fi_for_Studying_Lofi_Chill_And_Study_-_Chill_Fi_74576208.mp3',
    'Материалы/Lofi_Sleep_Chill_Study_Lo-Fi_for_Studying_Lofi_Chill_And_Study_-_Soul_Armor_74535308.mp3'
]

# Список вопросов для тестирования
QUESTIONS = [
    "Часто ли у вас возникают проблемы из-за того, что вы находитесь в состоянии стресса?",
    "Чувствуете ли вы сейчас раздраженность даже по отношению к вашим близким",
    "Трудно ли вам сконцентрироваться на задаче из-за стресса или беспокойства?",
    "Страдаете ли вы от бессонницы или других проблем со сном из-за стресса?",
    "Часто ли у вас возникает чувство усталости из-за стресса?"
]

# Картинки для ответов
GOOD_PHOTO_PATH = ['Материалы/все в твоих руках хорошо.jpg', 'Материалы/енот хорошо.jpg', 'Материалы/мечты хорошо.jpg',
                   'Материалы/море хорошо.jpg']
NORMAL_PHOTO_PATH = ['Материалы/напоминание норм.jpg', 'Материалы/огонек нормально.jpg', 'Материалы/кофе.jpg',
                     'Материалы/чай нормально.jpg', 'Материалы/место силы норм.jpg']
BAD_PHOTO_PATH = ['/Материалы/плохо бабочки.jpg', 'Материалы/держись кот плохо.png', 'Материалы/йода плохо 1.png', 'Материалы/плохо геленджик.jpg']
GOOD_ITOG_PATH = ['Материалы/капибары хороший итог.jpg', 'Материалы/справишься хороший итог.jpg', 'Материалы/хороший итог персики.jpg']
BAD_ITOG_PATH = ['Материалы/плохой итог доверяй.jpg', 'Материалы/плохой итог руки.jpg']
THANKS_PATH = 'Материалы/краб.jpg'

# Список возможных ответов для кнопки "Хорошо"
GOOD_RESPONSES = [
    "Я рад, что у вас все хорошо!",
    "Прекрасно, что вы в хорошем настроении!",
    "Это здорово, что вы счастливы!",
    "Отлично, хорошего Вам дня! Если что-то побеспокоит, напишите мне."
]

# Список возможных ответов для кнопки "Нормально"
NORMAL_RESPONSES = [
    "Не стесняйтесь расслабиться чашечкой чая, это помогает успокоиться.",
    "Отлично, что вы в норме, предлагаем закрепить и улучшить самочувствие чашечкой кофе! Не забывайте, что вы всегда можете написать мне, если что-то случится.",
    "Для поднятия Вам настроения советуем спуститься в кофейню и выпить любимый напиток с конфетой."
]